app/controllers/posts_controller.rb

    def show
        @post = Post.find(params[:id]) #running a database query on the Post model that will return a post with an ID that matches the route parameters
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]